03/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 40; // 0.04 * 10e6 Pa / 1000 kg/m³ = 40 m²/s² 
internalField uniform 0;

boundaryField
{
    inlet_one
    {
        type            fixedValue;
        value		uniform 300;
        //type		zeroGradient;
    }

    inlet_two
    {
        type		fixedValue;
        value		uniform 300;
        //type		zeroGradient;
    }

    outlet
    {
        //type		zeroGradient;
        type            fixedValue;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
	type		wedge;
    }
}

// ************************************************************************* //
